# Brewfile - Homebrew package management configuration
# Managed by Chezmoi template for cross-platform tool installation
# Requirements: 4.1, 4.2, 8.1

# Core development tools
brew "git"              # Version control
brew "curl"             # HTTP client
brew "wget"             # File download tool
brew "unzip"            # Archive handling
brew "tree"             # Directory tree display

# Modern CLI tools (replacements for traditional tools)
brew "eza"              # Modern ls replacement (active exa fork)
brew "bat"              # Modern cat replacement (always use bat, not batcat)
brew "fd"               # Modern find replacement (always use fd, not fd-find)
brew "ripgrep"          # Modern grep replacement
brew "fzf"              # Fuzzy finder
brew "zoxide"           # Smart directory jumper
brew "jq"               # JSON processor
brew "atool"            # Unified archive tool (replaces custom extract function)

# 1Password CLI (macOS only via Homebrew)
{{- if and (hasKey . "features") .features.enable_1password (eq .chezmoi.os "darwin") }}
tap "1password/tap"
cask "1password/tap/1password-cli"
{{- end }}

# Note: On Linux, 1Password CLI must be installed via apt repository

# Shell and terminal tools
brew "zsh"              # Modern shell (default on macOS)
brew "bash"             # Modern Bash (macOS ships old version)
brew "tmux"             # Terminal multiplexer
brew "starship"         # Cross-shell prompt

# Version management and performance tools
{{- if and (hasKey . "features") .features.enable_node }}
brew "fnm"              # Fast Node.js version manager
{{- end }}
brew "forgit"           # fzf-enhanced Git tool (replaces custom git functions)

# Editors and development tools
brew "neovim"           # Modern Vim
brew "htop"             # System monitor

{{- if eq .chezmoi.os "darwin" }}
# macOS specific tools
brew "mas"              # Mac App Store CLI
brew "mackup"           # macOS app config backup

# macOS applications (via Homebrew Cask)
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "1password"
cask "1password-cli"

# Nerd Fonts (via Homebrew Cask)
{{- if and (hasKey . "features") .features.enable_nerd_fonts }}
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
{{- end }}

{{- else if eq .chezmoi.os "linux" }}
# Linux specific tools
# Note: gcc and make should be installed via system package manager (apt install build-essential)
{{- end }}

{{- if and (hasKey . "features") .features.enable_ai_tools }}
# AI development tools (optional)
brew "gh"               # GitHub CLI
brew "glab"             # GitLab CLI
{{- end }}

{{- if and (hasKey . "features") .features.enable_proxy }}
# Proxy and networking tools (optional)
brew "proxychains-ng"   # Proxychains tool
{{- end }}

{{- if eq .environment "desktop" }}
# Desktop environment tools
{{- if eq .chezmoi.os "darwin" }}
cask "firefox"
cask "google-chrome"
cask "slack"
cask "zoom"
{{- end }}
{{- else if eq .environment "server" }}
# Server environment tools
brew "fail2ban"         # Security tool (if available)
{{- end }}

# Programming languages and runtime management
{{- if and (hasKey . "features") .features.enable_node }}
brew "node"             # Node.js
brew "npm"              # Node package manager
{{- end }}

{{- if and (hasKey . "features") .features.enable_python }}
brew "python@3.11"      # Python 3.11
brew "pipx"             # Python app installer
{{- end }}

{{- if and (hasKey . "features") .features.enable_go }}
brew "go"               # Go language
{{- end }}

{{- if and (hasKey . "features") .features.enable_rust }}
brew "rust"             # Rust language
{{- end }}

# Container and virtualization tools
{{- if and (hasKey . "features") .features.enable_docker }}
{{- if eq .chezmoi.os "linux" }}
brew "docker"           # Docker (Linux)
brew "docker-compose"   # Docker Compose
{{- end }}
{{- end }}

# Note: The following tools require special installation, not via Homebrew:
# - evalcache: install via git clone to ~/.evalcache
# - zim: install via curl script
# Installation logic for these tools is kept in the relevant config templates